Revit 2020 API
ExternalDefinition Members
The ExternalDefinition type exposes the following members.
Methods
Name | Description
Dispose
Releases all resources used by the ExternalDefinition
Equals
Determines whether the specified Object is equal to the current Object.
 (Inherited from Object.)
GetHashCode
Serves as a hash function for a particular type.
 (Inherited from Object.)
GetType
Gets the Type of the current instance.
 (Inherited from Object.)
ToString
Returns a string that represents the current object.
 (Inherited from Object.)
Properties
Name | Description
Description
 The description of the parameter. The description will be used as tooltip in the Revit UI including in the properties palette.
GUID
Returns the GUID associated with the shared parameter definition.
HideWhenNoValue
 Indicates whether this parameter should be hidden from the properties palette when it has no value.
IsValidObject
 Specifies whether the .NET object represents a valid Revit entity.
Name
The user visible name for the parameter.
 (Overrides Definition.Name.)
OwnerGroup
 Returns or change the group ID of the external parameter definition.
ParameterGroup
 Returns the group ID of the parameter definition.
 (Overrides Definition.ParameterGroup.)
ParameterType
Returns the user visible interpretation of the parameter data.
 (Overrides Definition.ParameterType.)
UnitType
 Returns the UnitType of the parameter definition.
 (Inherited from Definition.)
UserModifiable
 Indicates whether the parameter can be modified by the user interface.
Visible
Indicates if the parameter is visible in the Autodesk Revit user interface.
See Also
ExternalDefinition Class
Autodesk.Revit.DB Namespace